 /*******************************************************************************
*  Copyright (C) 2010 - All Rights Reserved
*		
* хМ╪ЧвВуъ:	фО╥и╪рвЕ
* ╟Фх╗кЫсп: фО╥и╣Гвс	
* ╢╢╫╗хуфз:	2012дЙ8тб18ху 
* хМ╪ЧюЗй╥:	2012дЙ8тб18хуйв╟Ф
* Version:  1.0 
* Demo лт╠╕╣ьж╥ё╨http://store.taobao.com/shop/view_shop.htm?asker=wangwang&shop_nick=qifeidianzi
**********************************************************************************************************************************************
юаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюа
юаюаюаюаюаюаюаюаюаюаюар╩юаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаю╖р╩юаюаюаюаюаюаюаюаюаюаюаюаюаюар╩р╩р╩р╩р╩р╩р╩юаюаюаюаюаюаюа
юаюаю╖р╩р╩р╩р╩юар╩р╩р╩р╩р╩р╩╤Чюаюаюаюаю╖р╩р╩р╩р╩р╩р╩р╩р╩юаюаюаюаюаюаюаюаюакд┘√юаюар╩р╩юаюаюар╩юаюаюаюаюаюаюаюаюар╩р╩р╩р╩кдкдр╩р╩р╩юаюаюаюаюаюа
юаюаюаюаюаюар╩юаюаюар╩╤Чр╩юаюаюаюаюаюар╩р╩р╩р╩кд┘√╤Чр╩кдюар╩р╩юаюаюаюаюакдр╩р╩р╩р╩р╩р╩р╩р╩р╩р╩р╩юаюаюаюаюаюаюаюакдюаюакдр╩р╩р╩р╩┘√юаюаюаюаюаюа
юаюаюакд┘√┘√р╩юаюа┘√юаюаюакдюаюаюаюаюаюаюаюаюаюаюаю╖р╩юар╩р╩юаюаюаюаюаюаюар╩р╩┘√┘√р╩р╩┘√┘√┘√р╩р╩юаюаюаюаюаюа┘√┘√┘√┘√┘√┘√р╩р╩┘√┘√┘√юаюаюаюаюаюа
юаюаюар╩юа╤Чр╩р╩р╩р╩р╩р╩р╩р╩р╩р╩р╩юаюаюаюаюаюаюаюа╤Чр╩р╩ю╖юаюаюаюаюаюаюаюар╩р╩р╩р╩р╩р╩р╩р╩р╩р╩кдюаюаюаюаюар╩р╩р╩р╩р╩р╩р╩р╩р╩р╩р╩р╩р╩р╩р╩юаюаюа
юаюаюар╩р╩р╩р╩р╩┘√╤Чр╩р╩┘√р╩юа┘√юаюаюаюаюаюаюаюаюар╩р╩р╩р╩р╩юаюаюаюаюаюаюар╩р╩юаюар╩р╩юаюаюар╩ю╖юаюаюаюаюар╩р╩кдюаюаюаюар╩р╩юаюаю╖р╩р╩кдюаюаюа
юаюаюаюаюаюаюар╩ю╖р╩юар╩┘√р╩юаюаюаюаюаюаюаюаюаюаюаю╖р╩юаюар╩р╩юаюаюаюаюаюар╩р╩р╩р╩р╩р╩р╩р╩р╩р╩┘√юаюаюаюаюаюаюаюаюаюаюаюар╩р╩┘√юаюаюаюаюаюаюаюа
юа╤Чр╩р╩р╩юакдю╖┘√р╩р╩р╩┘√р╩юаюаюаюаюаюаюаюаюаюаюаюар╩р╩юаюаюаюаюаюаюаюаюаюаюаюаюакдр╩┘√юаюаюаюаюаюар╩юаюаюаюаюаюаюаюаюар╩р╩┘√юаюаюаюаюаюаюаюа
юаюаюаюаюаюар╩юаюаюаюаюар╩р╩юаюаюаюаюаюаюаюаюаюаюаюа┘√р╩р╩р╩р╩р╩р╩ю╖юаюаюаюаюаюаюаюар╩р╩р╩р╩р╩р╩р╩р╩р╩юаюаюаюаюаю╖юаюа┘√р╩р╩юаюаюаюаюаюаюаюаюа
юаюаюаюар╩р╩р╩юаюаю╖р╩р╩р╩р╩юаюаюаюаюаюаюаюаюаюаюаюаюаюар╩р╩р╩р╩р╩юаюаюаюаюаюаюаюаюаюар╩р╩р╩р╩р╩р╩р╩юаюаюаюаюаюаюар╩р╩р╩р╩кдюаюаюаюаюаюаюаюаюа
юаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюа
**********************************************************************************************************************************************/

#ifndef __DELAY_H
#define __DELAY_H 			   
void delay_init(u8 SYSCLK);
void delay_ms(u16 nms);
void delay_us(u32 nus);

#endif





























