/*******************************************************************************
*  Copyright (C) 2010 - All Rights Reserved
*		
* Èí¼þ×÷Õß:	Æï·É¼Ò×å
* °æÈ¨ËùÓÐ: Æï·Éµç×Ó	
* ´´½¨ÈÕÆÚ:	2012Äê8ÔÂ18ÈÕ 
* Èí¼þÀúÊ·:	2012Äê8ÔÂ18ÈÕÊ×°æ
* Version:  1.0 
* Demo ÌÔ±¦µØÖ·£ºhttp://store.taobao.com/shop/view_shop.htm?asker=wangwang&shop_nick=qifeidianzi
**********************************************************************************************************************************************
ÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁ
ÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÒ»ÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀ§Ò»ÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÒ»Ò»Ò»Ò»Ò»Ò»Ò»ÀÁÀÁÀÁÀÁÀÁÀÁÀÁ
ÀÁÀÁÀ§Ò»Ò»Ò»Ò»ÀÁÒ»Ò»Ò»Ò»Ò»Ò»¶þÀÁÀÁÀÁÀÁÀ§Ò»Ò»Ò»Ò»Ò»Ò»Ò»Ò»ÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁËÄ…–ÀÁÀÁÒ»Ò»ÀÁÀÁÀÁÒ»ÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÒ»Ò»Ò»Ò»ËÄËÄÒ»Ò»Ò»ÀÁÀÁÀÁÀÁÀÁÀÁ
ÀÁÀÁÀÁÀÁÀÁÀÁÒ»ÀÁÀÁÀÁÒ»¶þÒ»ÀÁÀÁÀÁÀÁÀÁÀÁÒ»Ò»Ò»Ò»ËÄ…–¶þÒ»ËÄÀÁÒ»Ò»ÀÁÀÁÀÁÀÁÀÁËÄÒ»Ò»Ò»Ò»Ò»Ò»Ò»Ò»Ò»Ò»Ò»ÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁËÄÀÁÀÁËÄÒ»Ò»Ò»Ò»…–ÀÁÀÁÀÁÀÁÀÁÀÁ
ÀÁÀÁÀÁËÄ…–…–Ò»ÀÁÀÁ…–ÀÁÀÁÀÁËÄÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀ§Ò»ÀÁÒ»Ò»ÀÁÀÁÀÁÀÁÀÁÀÁÀÁÒ»Ò»…–…–Ò»Ò»…–…–…–Ò»Ò»ÀÁÀÁÀÁÀÁÀÁÀÁ…–…–…–…–…–…–Ò»Ò»…–…–…–ÀÁÀÁÀÁÀÁÀÁÀÁ
ÀÁÀÁÀÁÒ»ÀÁ¶þÒ»Ò»Ò»Ò»Ò»Ò»Ò»Ò»Ò»Ò»Ò»ÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁ¶þÒ»Ò»À§ÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÒ»Ò»Ò»Ò»Ò»Ò»Ò»Ò»Ò»Ò»ËÄÀÁÀÁÀÁÀÁÀÁÒ»Ò»Ò»Ò»Ò»Ò»Ò»Ò»Ò»Ò»Ò»Ò»Ò»Ò»Ò»ÀÁÀÁÀÁ
ÀÁÀÁÀÁÒ»Ò»Ò»Ò»Ò»…–¶þÒ»Ò»…–Ò»ÀÁ…–ÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÒ»Ò»Ò»Ò»Ò»ÀÁÀÁÀÁÀÁÀÁÀÁÀÁÒ»Ò»ÀÁÀÁÒ»Ò»ÀÁÀÁÀÁÒ»À§ÀÁÀÁÀÁÀÁÀÁÒ»Ò»ËÄÀÁÀÁÀÁÀÁÒ»Ò»ÀÁÀÁÀ§Ò»Ò»ËÄÀÁÀÁÀÁ
ÀÁÀÁÀÁÀÁÀÁÀÁÀÁÒ»À§Ò»ÀÁÒ»…–Ò»ÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀ§Ò»ÀÁÀÁÒ»Ò»ÀÁÀÁÀÁÀÁÀÁÀÁÒ»Ò»Ò»Ò»Ò»Ò»Ò»Ò»Ò»Ò»…–ÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÒ»Ò»…–ÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁ
ÀÁ¶þÒ»Ò»Ò»ÀÁËÄÀ§…–Ò»Ò»Ò»…–Ò»ÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÒ»Ò»ÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁËÄÒ»…–ÀÁÀÁÀÁÀÁÀÁÀÁÒ»ÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÒ»Ò»…–ÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁ
ÀÁÀÁÀÁÀÁÀÁÀÁÒ»ÀÁÀÁÀÁÀÁÀÁÒ»Ò»ÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁ…–Ò»Ò»Ò»Ò»Ò»Ò»À§ÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÒ»Ò»Ò»Ò»Ò»Ò»Ò»Ò»Ò»ÀÁÀÁÀÁÀÁÀÁÀ§ÀÁÀÁ…–Ò»Ò»ÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁ
ÀÁÀÁÀÁÀÁÒ»Ò»Ò»ÀÁÀÁÀ§Ò»Ò»Ò»Ò»ÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÒ»Ò»Ò»Ò»Ò»ÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÒ»Ò»Ò»Ò»Ò»Ò»Ò»ÀÁÀÁÀÁÀÁÀÁÀÁÀÁÒ»Ò»Ò»Ò»ËÄÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁ
ÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁÀÁ
**********************************************************************************************************************************************/


#ifndef I2C_H
#define I2C_H
/***************************************************************************
Í·ÎÄ¼þ
***************************************************************************/
#include "sys.h"



#define SDA_IN0()  {GPIOC->CRH&=0XFFFF0FFF;GPIOC->CRH|=8<<12;}
#define SDA_OUT0() {GPIOC->CRH&=0XFFFF0FFF;GPIOC->CRH|=3<<12;}


//IO²Ù×÷º¯Êý	 
#define I2C_SCL0    PCout(12) //SCL
#define I2C_SDA0    PCout(11) //SDA	 
#define SDA_STATE0  PCin(11)  //ÊäÈëSDA 



void InitI2C0(void);   //I2C³õÊ¼»¯
void StartI2C0(void);  //ÆðÊ¼ÐÅºÅ
void StopI2C0(void);  //Í£Ö¹ÐÅºÅ
void NoAck0(void);   //·ÇÓ¦´ðÐÅºÅ
void Ack0(void);
unsigned char TestAck0(void);
unsigned char I2CWrite0(unsigned char DData);   //Ð´Ò»¸ö×Ö½Ú
unsigned char I2CRead0(void);  //¶ÁÒ»¸ö×Ö½Ú

#endif 
