
/*******************************************************************************
*  Copyright (C) 2010 - All Rights Reserved
*		
* 软件作者:	骑飞家族
* 版权所有: 骑飞电子	
* 创建日期:	2012年8月18日 
* 软件历史:	2012年8月18日首版
* Version:  1.0 
* Demo 淘宝地址：http://store.taobao.com/shop/view_shop.htm?asker=wangwang&shop_nick=qifeidianzi
**********************************************************************************************************************************************
懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒
懒懒懒懒懒懒懒懒懒懒懒一懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒困一懒懒懒懒懒懒懒懒懒懒懒懒懒懒一一一一一一一懒懒懒懒懒懒懒
懒懒困一一一一懒一一一一一一二懒懒懒懒困一一一一一一一一懒懒懒懒懒懒懒懒懒四厲懒懒一一懒懒懒一懒懒懒懒懒懒懒懒懒一一一一四四一一一懒懒懒懒懒懒
懒懒懒懒懒懒一懒懒懒一二一懒懒懒懒懒懒一一一一四厲二一四懒一一懒懒懒懒懒四一一一一一一一一一一一懒懒懒懒懒懒懒懒四懒懒四一一一一厲懒懒懒懒懒懒
懒懒懒四厲厲一懒懒厲懒懒懒四懒懒懒懒懒懒懒懒懒懒懒困一懒一一懒懒懒懒懒懒懒一一厲厲一一厲厲厲一一懒懒懒懒懒懒厲厲厲厲厲厲一一厲厲厲懒懒懒懒懒懒
懒懒懒一懒二一一一一一一一一一一一懒懒懒懒懒懒懒懒二一一困懒懒懒懒懒懒懒懒一一一一一一一一一一四懒懒懒懒懒一一一一一一一一一一一一一一一懒懒懒
懒懒懒一一一一一厲二一一厲一懒厲懒懒懒懒懒懒懒懒懒一一一一一懒懒懒懒懒懒懒一一懒懒一一懒懒懒一困懒懒懒懒懒一一四懒懒懒懒一一懒懒困一一四懒懒懒
懒懒懒懒懒懒懒一困一懒一厲一懒懒懒懒懒懒懒懒懒懒懒困一懒懒一一懒懒懒懒懒懒一一一一一一一一一一厲懒懒懒懒懒懒懒懒懒懒懒懒一一厲懒懒懒懒懒懒懒懒
懒二一一一懒四困厲一一一厲一懒懒懒懒懒懒懒懒懒懒懒懒一一懒懒懒懒懒懒懒懒懒懒懒懒懒四一厲懒懒懒懒懒懒一懒懒懒懒懒懒懒懒懒一一厲懒懒懒懒懒懒懒懒
懒懒懒懒懒懒一懒懒懒懒懒一一懒懒懒懒懒懒懒懒懒懒懒懒厲一一一一一一困懒懒懒懒懒懒懒懒一一一一一一一一一懒懒懒懒懒困懒懒厲一一懒懒懒懒懒懒懒懒懒
懒懒懒懒一一一懒懒困一一一一懒懒懒懒懒懒懒懒懒懒懒懒懒懒一一一一一懒懒懒懒懒懒懒懒懒懒一一一一一一一懒懒懒懒懒懒懒一一一一四懒懒懒懒懒懒懒懒懒
懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒
**********************************************************************************************************************************************/

/***************************************************************************
名    称： I2C.C
功    能： 子函数定义
作    者： H&G
版    本： V1.0
创建时间： 2011-6-10
***************************************************************************/

/***************************************************************************
头文件
***************************************************************************/
#include<I2C.h>
#include<delay.h>

/***************************************************************************
名    称：void InitI2C0(void)
功    能：初始化IO口
入口参数：无
出口参数：无
说    明：
调用方法：InitI2C0();
***************************************************************************/
void InitI2C0(void)
{
	RCC->APB2ENR|=1<<4;//先使能外设IO PORTC时钟 							 
	GPIOC->CRH&=0XFFF00FFF;//PC11/12 推挽输出
	GPIOC->CRH|=0X00033000;	   
	GPIOC->ODR|=3<<11;     //PC11,12 输出高
}

/***************************************************************************
名    称：void StartI2C0(void)
功    能：启动I2C总线，即发送I2C初始条件
入口参数：无
出口参数：无
说    明：
调用方法：StartI2C0();
***************************************************************************/
void StartI2C0(void)
{
    I2C_SDA0=1;    
    delay_us(100);

    I2C_SCL0=1;	   
    delay_us(100);
 
    I2C_SDA0=0;
    delay_us(100);

    I2C_SCL0=0;	 
    delay_us(100);


}

/***************************************************************************
名    称：void StopI2C0(void)
功    能：结束I2C总线，即发送I2C结束条件
入口参数：无
出口参数：无
说    明：
调用方法：StopI2C0();
***************************************************************************/
void StopI2C0(void)
{
	I2C_SDA0=0;
    delay_us(100);
 
    I2C_SCL0=1;
    delay_us(100);  

    I2C_SDA0=1;
    delay_us(100);
 

}

/***************************************************************************
名    称：void NoAck0(void)
功    能：无应答
入口参数：无
出口参数：无
说    明：
调用方法：NoAck0();
***************************************************************************/
void NoAck0(void)
{
	
	I2C_SDA0=1;
	delay_us(100);
	
	I2C_SCL0=1;
	delay_us(100);
	
	I2C_SCL0=0;
	delay_us(100);
	
	I2C_SDA0=0;
	delay_us(100);

}
/***************************************************************************
名    称：void Ack0(void)
功    能：总线应答
入口参数：无
出口参数：无
说    明：
调用方法：Ack0();
***************************************************************************/
void Ack0(void)
{
	SDA_OUT0();
 	I2C_SDA0=1;
    delay_us(100); 
    I2C_SCL0=1;
    delay_us(100); 
	I2C_SCL0=0;
    delay_us(100); 
 	I2C_SDA0=1;

	
}
/***************************************************************************
名    称：unsigned char TestAck0( )
功    能：应答校验
入口参数：无
出口参数：应答状态
说    明：
调用方法：m=TestAck0();
***************************************************************************/
unsigned char TestAck0( )
{
	unsigned char ack;

	I2C_SCL0=1;
	delay_us(100);
	SDA_IN0();
	delay_us(100);
	ack=SDA_STATE0;
	delay_us(100);
	I2C_SCL0=0;
	delay_us(100);
	return(ack);


}
/***************************************************************************
名    称：unsigned char I2CWrite0(unsigned char DData)
功    能：向I2C总线上发送1字节数据
入口参数：DData    待发送数据
出口参数：无
说    明：
调用方法：NoAck0();
***************************************************************************/
unsigned char I2CWrite0(unsigned char DData)
{
	unsigned char j,tem;

	for(j=0;j<8;j++) 
	{
		if((DData<<j)&0x80)
		{
			I2C_SDA0=1;
		}
		else
		{
			I2C_SDA0=0;
		}
		delay_us(100);
		I2C_SCL0=1;
		delay_us(100);
		I2C_SCL0=0;;
		delay_us(100);

	}
	delay_us(100);
	
	SDA_IN0();
	delay_us(100);
	I2C_SCL0=1;
	delay_us(1000);
	if(SDA_STATE0==1)
	{
		tem=0;  
	}
	else
	{
		tem=1;   
	}
	I2C_SCL0=0;
	delay_us(100);	
    SDA_OUT0();

	return(tem);  
}

/***************************************************************************
名    称：unsigned char I2CRead0(void)
功    能：从I2C总线上接收1字节数据
入口参数：无
出口参数：接收数据
说    明：
调用方法：m=I2CRead0();
***************************************************************************/
unsigned char I2CRead0(void)
{
	unsigned char read,j;
	read=0x00;
	
	SDA_IN0();
	delay_us(100);
	for(j=8;j>0;j--) 
	{		     
		delay_us(100);
		I2C_SCL0=1;
		delay_us(100);
		read=read<<1;
		if(SDA_STATE0==1) 
		{
			read=read+1;
		}
		I2C_SCL0=0;
		delay_us(100);
	}	
	return(read);
}


/***************************************************************************
***************************************************************************/
